LogFiles/HtmlVaporClientWrk2V1bc.txt
Running 15s test @ http://169.254.90.222:8080/jsonShortVapor
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.136ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.122ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms  810.98us   5.52ms   70.00%
    Req/Sec    56.58     87.30   333.00     77.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.74ms
 75.000%    3.20ms
 90.000%    3.84ms
 99.000%    5.33ms
 99.900%    5.53ms
 99.990%    5.53ms
 99.999%    5.53ms
100.000%    5.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.023     0.000000            1         1.00
       1.816     0.100000           49         1.11
       2.081     0.200000          100         1.25
       2.355     0.300000          148         1.43
       2.581     0.400000          197         1.67
       2.743     0.500000          245         2.00
       2.843     0.550000          270         2.22
       2.929     0.600000          295         2.50
       2.999     0.650000          320         2.86
       3.101     0.700000          343         3.33
       3.197     0.750000          368         4.00
       3.249     0.775000          381         4.44
       3.331     0.800000          392         5.00
       3.395     0.825000          405         5.71
       3.497     0.850000          417         6.67
       3.709     0.875000          429         8.00
       3.745     0.887500          435         8.89
       3.837     0.900000          441        10.00
       3.913     0.912500          448        11.43
       3.953     0.925000          454        13.33
       4.135     0.937500          460        16.00
       4.207     0.943750          463        17.78
       4.243     0.950000          466        20.00
       4.315     0.956250          469        22.86
       4.387     0.962500          472        26.67
       4.535     0.968750          475        32.00
       4.599     0.971875          477        35.56
       4.607     0.975000          478        40.00
       4.619     0.978125          480        45.71
       4.659     0.981250          481        53.33
       4.935     0.984375          483        64.00
       5.059     0.985938          484        71.11
       5.059     0.987500          484        80.00
       5.331     0.989062          485        91.43
       5.399     0.990625          486       106.67
       5.403     0.992188          487       128.00
       5.403     0.992969          487       142.22
       5.403     0.993750          487       160.00
       5.455     0.994531          488       182.86
       5.455     0.995313          488       213.33
       5.523     0.996094          489       256.00
       5.523     0.996484          489       284.44
       5.523     0.996875          489       320.00
       5.523     0.997266          489       365.71
       5.523     0.997656          489       426.67
       5.527     0.998047          490       512.00
       5.527     1.000000          490          inf
#[Mean    =        2.777, StdDeviation   =        0.811]
#[Max     =        5.524, Total count    =          490]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1502 requests in 15.00s, 239.09KB read
Requests/sec:    100.11
Transfer/sec:     15.94KB